tap "argoproj/tap"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "minamijoyo/tfmigrate"
tap "reviewdog/tap"
tap "shivammathur/php"
tap "tomanthony/brews"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU multiple precision arithmetic library
brew "gmp"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Text processing system for reStructuredText
brew "docutils"
# Asynchronous event library
brew "libevent"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU awk utility
brew "gawk"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Open source suite of directory software
brew "openldap"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Editor of encrypted files
brew "sops"
# Implementation of the Secure Real-time Transport Protocol
brew "srtp"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# Allows you setup pre-configured layouts of panes in iTerm2
brew "tomanthony/brews/itermocil"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Manage team projects and tasks
cask "asana"
# Cloud storage service
cask "baidunetdisk"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Tool for multi-language users
cask "input-source-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to manage software development and track bugs
cask "linear-linear"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Instant messaging tool
cask "qq"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# VPN and WiFi proxy
cask "thunder"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Video conferencing software
cask "voov-meeting"
# Free messaging and calling application
cask "wechat"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "42crunch.vscode-openapi"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jakebecker.elixir-ls"
vscode "lokalise.i18n-ally"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "pantajoe.vscode-elixir-credo"
vscode "redhat.vscode-yaml"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zoellner.openapi-preview"
